""" Recomendations. """

Системные требования, без которых лучше не пользоваться разработанными инструментами. Здесь следует указать параметры ОЗУ, размера диска, версии ОС и другие критически важные данные.
Гайд по безопасной установке.
Обзор функций и возможностей.
Инструкция по использованию и примеры решения задач, с помощью возможностей программы.

Ответы на часто задаваемые вопросы.
Инструкцию, которая поможет проверить, правильно ли установлена программа. Пользователь должен иметь возможность протестировать работоспособность с помощью командной строки.
Примеры вывода.
Лицензионное соглашение.
Скриншоты, если они могут понадобиться.
Контактную информацию.
