""" Notes about management."""

1. Для вопросов выживания имеющих системный характер, при наличии мультипликативных
процессов(типа пандемии), требуется не "доказательство причинённого вреда", а 
" доказательство отсутствия вреда".

2. Для толстохвостых мультипликативных процессов с катастрофическими системными
рисками(типа пандемии), традиционный анализ "затрат-выгод" неприменим.

3. Экономику и пандемию неверно рассматривать, как отдельные независимые 
элементы, а поиск компромиса между экономическими издержками и мерами по
смягчению пандемии наивен и ошибочен.
